import React, { useState } from 'react';
import {
    View,
    Modal,
    Text,
    TextInput,
    TouchableOpacity,
    ScrollView,
    I18nManager
} from 'react-native';

import Icon from 'react-native-vector-icons/FontAwesome';
import { connect } from 'react-redux';
import { Picker } from '@react-native-picker/picker';

import { reach } from 'yup';
import AppColor from '../constant/AppColor';
import sizeHelper from '../helpers/sizeHelper';
import { CheckBoxCustom } from './CheckBoxCustom';
import CustomButton from './CustomButton';
import CustomDropDown from './CustomDropDown';
import { CustomMenu } from './CustomMenu';

const PrivacyPolicy = ({
    displayAlert,
    isPromptAlert,
    terminalCode,
    StringsList,
    onAcceptPrivacy,
    onPressCancel,
}) => {


    return (
        <Modal visible={displayAlert} transparent={true} animationType={'fade'}>
            <View
                style={{
                    flex: 1,
                    justifyContent: 'center',
                    alignItems: 'center',
                    borderRadius: 25,
                }}>

                <View
                    style={{
                        width: '90%',
                        backgroundColor: AppColor.white,
                        paddingVertical: sizeHelper.calHp(20),
                        // justifyContent: 'center',
                        // alignItems: 'center',
                        borderBottomLeftRadius: sizeHelper.calHp(10),
                        borderBottomRightRadius: sizeHelper.calHp(10),
                        paddingHorizontal: sizeHelper.calWp(20),
                    }}>

                    <ScrollView
                        showsVerticalScrollIndicator={false}
                        style={{
                            height: sizeHelper.calHp(800),
                        }}>
                        <Text style={{
                            fontSize: sizeHelper.calHp(40),
                            color: AppColor.black,
                            marginTop: sizeHelper.calHp(18),
                            fontFamily: 'ProximaNova-Regular',
                        }}>

                            تاريخ السريان: 2022-05-02
                            {'\n'}1 المقدمة
                            {'\n'} مرحبا بكم في تطبيق بنود POS.
                            {'\n'} تطبيق بنودي POS(يشار إليها فيما بعد باسم "الخدمة").
                            {'\n'}تحكم سياسة الخصوصية الخاصة بنا زيارتك لموقع Bnody.com ، وتشرح كيف نقوم بجمع وحماية والكشف عن المعلومات التي تنتج عن استخدامك لخدماتنا.
                            {'\n'} نستخدم بياناتك لتقديم الخدمة وتحسينها. باستخدام الخدمة ، فإنك توافق على جمع واستخدام المعلومات وفقًا لهذه السياسة. ما لم يتم تحديد خلاف ذلك في سياسة الخصوصية هذه ، فإن المصطلحات المستخدمة في سياسة الخصوصية هذه لها نفس المعاني كما في الشروط والأحكام الخاصة بنا.
                            {'\n'} تحكم شروطها وأحكامها ("الشروط") جميع استخدامات خدمتنا وتشكل جنبًا إلى جنب مع سياسة الخصوصية اتفاقك معنا ("الاتفاقية").
                            {'\n'} 2. التعاريف
                            {'\n'}الخدماتيقصد به موقع Bnody.com الذي يديره تطبيق Bnody POS.
                            {'\n'} بيانات شخصية تعني بيانات عن فرد على قيد الحياة يمكن تحديد هويته من تلك البيانات (أو من تلك المعلومات وغيرها سواء في حوزتنا أو من المحتمل أن تكون في حوزتنا).
                            {'\n'} بيانات الاستخدام هي البيانات التي يتم جمعها تلقائيًا إما عن طريق استخدام الخدمة أو من البنية التحتية للخدمة نفسها (على سبيل المثال ، مدة زيارة الصفحة).
                            {'\n'} الكوكيز هي ملفات صغيرة مخزنة على جهازك (الكمبيوتر أو الجهاز المحمول).
                            {'\n'}متحكم بيانات تعني شخصًا طبيعيًا أو اعتباريًا (إما بمفرده أو بشكل مشترك أو بالاشتراك مع أشخاص آخرين) يحدد الأغراض التي من أجلها والطريقة التي تتم بها معالجة أي بيانات شخصية أو يتعين معالجتها لغرض سياسة الخصوصية هذه ، نحن نراقب البيانات لبياناتك.
                            {'\n'}معالجات البيانات (أو مقدمو الخدمة)يُقصد بها أي شخص طبيعي أو اعتباري يقوم بمعالجة البيانات نيابة عن وحدة التحكم في البيانات قد نستخدم خدمات مختلفة لمقدمي الخدمة من أجل معالجة بياناتك بشكل أكثر فعالية.
                            {'\n'}موضوع البيانات هو أي فرد على قيد الحياة موضوع ,للبيانات الشخصية,
                            {'\n'}المستخدم هو الفرد الذي يستخدم خدمتنا. يتوافق المستخدم مع موضوع البيانات ، وهو موضوع البيانات الشخصية.
                            {'\n'}3. جمع المعلومات واستخدامها
                            {'\n'}نقوم بجمع عدة أنواع مختلفة من المعلومات لأغراض مختلفة لتوفير وتحسين خدماتنا لك.
                            {'\n'} 4. أنواع البيانات المجمعة
                            {'\n'} بيانات شخصية
                            {'\n'} أثناء استخدام خدمتنا ، قد نطلب منك تزويدنا ببعض معلومات التعريف الشخصية التي يمكن استخدامها للاتصال أو التعرف عليك ("البيانات الشخصية"). قد تتضمن معلومات التعريف الشخصية ، على سبيل المثال لا الحصر:
                            {'\n'} 0.1. عنوان بريد إلكتروني
                            {'\n'} 0.2 الاسم الأول واسم العائلة
                            {'\n'} 0.3 رقم الهاتف
                            {'\n'} 0.4 العنوان ، البلد ، الولاية ، المقاطعة ، الرمز البريدي / الرمز البريدي ، المدينة
                            {'\n'} 0.5 ملفات تعريف الارتباط وبيانات الاستخدام
                            {'\n'} قد نستخدم بياناتك الشخصية للاتصال بك من خلال النشرات الإخبارية والمواد التسويقية أو الترويجية وغيرها من المعلومات التي قد تهمك. يمكنك إلغاء الاشتراك في تلقي أي من هذه الاتصالات أو جميعها منا باتباع رابط إلغاء الاشتراك.
                            {'\n'} بيانات الاستخدام
                            {'\n'}قد نقوم أيضًا بجمع المعلومات التي يرسلها متصفحك عندما تزور خدمتنا أو عندما تصل إلى الخدمة عن طريق أو من خلال أي جهاز ("بيانات الاستخدام").
                            {'\n'} قد تتضمن بيانات الاستخدام هذه معلومات مثل عنوان بروتوكول الإنترنت لجهاز الكمبيوتر الخاص بك (مثل عنوان IP) ، ونوع المتصفح ، وإصدار المتصفح ، وصفحات الخدمة التي تزورها ، ووقت وتاريخ زيارتك ، والوقت الذي تقضيه على تلك الصفحات ، معرّفات الجهاز الفريدة وبيانات التشخيص الأخرى.
                            {'\n'}عند الوصول إلى الخدمة باستخدام جهاز ، قد تتضمن بيانات الاستخدام هذه معلومات مثل نوع الجهاز الذي تستخدمه ، و المعرف الفريد لجهازك ، وعنوان IP الخاص بجهازك ، ونظام تشغيل جهازك ، ونوع متصفح الإنترنت الذي تستخدمه ،  معرّفات الجهاز الفريدة وبيانات التشخيص الأخرى.
                            {'\n'} بيانات الموقع
                            {'\n'} قد نستخدم معلومات عن موقعك وخزنها إذا سمحت لنا بذلك ("بيانات الموقع"). نستخدم هذه البيانات لتوفير ميزات خدمتنا ، لتحسين وتخصيص خدمتنا.
                            {'\n'} يمكنك تمكين أو تعطيل خدمات الموقع عند استخدام خدماتنا في أي وقت عن طريق إعدادات جهازك.
                            {'\n'} تتبع بيانات ملفات تعريف الارتباط
                            {'\n'} نحن نستخدم ملفات تعريف الارتباط وتقنيات التتبع المماثلة لتتبع النشاط على خدمتنا ونحتفظ بمعلومات معينة.
                            {'\n'}  ملفات تعريف الارتباط هي ملفات تحتوي على كمية صغيرة من البيانات التي قد تتضمن معرفًا فريدًا مجهول الهوية. يتم إرسال ملفات تعريف الارتباط إلى متصفحك من موقع ويب وتخزينها على جهازك. تُستخدم تقنيات التتبع الأخرى أيضًا مثل الإشارات والعلامات والنصوص لجمع المعلومات وتتبعها و تحسين خدمتنا وتحليلها.
                            {'\n'} يمكنك توجيه متصفحك لرفض جميع ملفات تعريف الارتباط أو للإشارة إلى وقت إرسال ملف تعريف الارتباط. ومع ذلك ، إذا كنت لا تقبل ملفات تعريف الارتباط ، فقد لا تتمكن من استخدام بعض أجزاء من خدمتنا.
                            {'\n'} أمثلة على ملفات تعريف الارتباط التي نستخدمها:
                            {'\n'}  0.1. ملفات تعريف ارتباط الجلسة: نستخدم ملفات تعريف ارتباط الجلسة لتشغيل خدمتنا.
                            {'\n'} 0.2 ملفات تعريف الارتباط المفضلة: نستخدم ملفات تعريف الارتباط المفضلة لتذكر تفضيلاتك والإعدادات المختلفة.
                            {'\n'}  0.3 ملفات تعريف الارتباط الأمنية: نستخدم ملفات تعريف الارتباط الأمنية لأغراض أمنية.
                            {'\n'} 0.4 ملفات تعريف الارتباط الإعلانية: تُستخدم ملفات تعريف الارتباط الإعلانية لخدمتك مع الإعلانات التي قد تكون ذات صلة بك واهتماماتك.
                            {'\n'} بيانات أخرى
                            {'\n'} أثناء استخدام خدمتنا ، قد نقوم أيضًا بجمع المعلومات التالية: الجنس ، والعمر ، وتاريخ الميلاد ، ومكان الميلاد ، وتفاصيل جواز السفر ، والجنسية ، والتسجيل في مكان الإقامة والعنوان الفعلي ، ورقم الهاتف (العمل ، والجوال) ، تفاصيل المستندات في التعليم والتأهيل والتدريب المهني واتفاقيات العمل ،اتفاقيات NDA، معلومات عن المكافآت والتعويضات ، معلومات عن الحالة الاجتماعية ، أفراد الأسرة ، رقم الضمان الاجتماعي (أو رقم تعريف دافع الضرائب الآخر) ، أو موقع المكتب وبيانات أخرى.
                            {'\n'}  5. استخدام البيانات
                            {'\n'}  يستخدم تطبيق Bnody POS البيانات التي تم جمعها لأغراض مختلفة:
                            {'\n'} 0.1. لتقديم خدماتنا والحفاظ عليها
                            {'\n'} 0.2 لإعلامك عن تغييرات لخدمتنا
                            {'\n'} 0.3 السماح لك بالمشاركة في الميزات التفاعلية لخدمتنا عندما تختار القيام بذلك
                            {'\n'} 0.4 لتقديم دعم العملاء
                            {'\n'} 0.5 لجمع التحليل أو المعلومات القيمة حتى نتمكن من تحسين خدماتنا
                            {'\n'} 0.6 لمراقبة استخدام خدمتنا
                            {'\n'} 0.7. لاكتشاف ومنع ومعالجة القضايا الفنية
                            {'\n'} 0.8 لتحقيق أي غرض آخر تقدمه من أجله
                            {'\n'} 0.9 تنفيذ التزاماتنا وإنفاذ حقوقنا الناشئة عن أي عقود مبرمة بينك وبيننا ، بما في ذلك الفواتير والتحصيل
                            {'\n'} 0.10. لتزويدك بإشعارات حول حسابك / أو اشتراكك ، بما في ذلك إشعارات انتهاء الصلاحية والتجديد وإرشادات البريد الإلكتروني وما إلى ذلك
                            {'\n'}  0.11. لتزويدك بالاخبار والعروض الخاصة والمعلومات العامة حول السلع والخدمات والأحداث الأخرى التي نقدمها والتي تشبه تلك التي اشتريتها بالفعل أو استفسرت عنها ما لم تكن قد اخترت عدم تلقي هذه المعلومات
                            {'\n'}  0.12. بأي طريقة أخرى قد نصفها عند تقديم المعلومات
                            {'\n'}  0.13. لأي غرض آخر بموافقتك.
                            {'\n'} 6. الاحتفاظ بالبيانات
                            {'\n'} سنحتفظ ببياناتك الشخصية فقط طالما كان ذلك ضروريًا للأغراض المنصوص عليها في سياسة الخصوصية هذه ، يحتفظ ببياناتك الشخصية ونستخدمها بالقدر اللازم للامتثال بالتزاماتها القانونية (على سبيل المثال ، إذا كنا مطالبين الاحتفاظ ببياناتك للامتثال للقوانين المعمول بها) ، وحل النزاعات ، وفرض اتفاقيتنا سياساتنا القانونية.
                            {'\n'}  سنحتفظ أيضًا بالبيانات الاستخدام لأغراض التحليل الداخلي. يتم الاحتفاظ ببيانات الاستخدام عمومًا لفترة أقصر ، إلا في حالة استخدام هذه البيانات لتعزيز الأمن أو لتحسين وظائف خدمتنا ، أو نحن ملزمون قانونًا بالاحتفاظ بهذه البيانات لفترات زمنية أطول.
                            {'\n'} 7. نقل البيانات
                            قد يتم نقل معلوماتك ، بما في ذلك البيانات الشخصية ، إلى أجهزة الكمبيوتر الموجودة خارج ولايتك أو مقاطعتك أو بلدك أو الولاية القضائية الحكومية الأخرى التي قد تختلف فيها قوانين حماية البيانات عن تلك الموجودة في ولايتك القضائية.
                            إذا كنت متواجدًا خارج المملكة العربية السعودية و اخترت تقديم معلومات لنا ، يرجى ملاحظة أننا نقوم بنقل البيانات ، بما في ذلك البيانات الشخصية ، إلى المملكة العربية السعودية ومعالجتها هناك.
                            موافقتك على سياسة الخصوصية هذه متبوعة بتقديمك لهذه المعلومات تمثل موافقتك على هذا النقل.
                            سيتخذ تطبيق Bnody POS جميع الخطوات اللازمة بشكل معقول لضمان معالجة بياناتك بشكل آمن ووفقًا لسياسة الخصوصية هذه ولن يتم نقل بياناتك الشخصية إلى منظمة أو دولة ما لم تكن هناك ضوابط كافية مطبقة بما في ذلك أمن بياناتك وغيرها من المعلومات الشخصية.
                            {'\n'} 8. الإفصاح عن البيانات
                            قد نكشف عن المعلومات الشخصية التي نجمعها ، أو تقدم:
                            {'\n'} 0.1. الإفصاح عن جهات إنفاذ القانون.
                            في ظل ظروف معينة ، قد يُطلب منا الكشف عن بياناتك الشخصية إذا طُلب منا ذلك بموجب القانون أو استجابة لطلبات صحيحة من السلطات العامة.
                            {'\n'} 0.2 المعاملات التجارية.
                            إذا شاركنا نحن أو الشركات التابعة لنا في عملية دمج أو استحواذ أو بيع أصول ، فقد يتم نقل بياناتك الشخصية.
                            {'\n'} 0.3 حالات اخرى. قد نكشف عن معلوماتك أيضًا:
                            {'\n'}  0.3.1. إلى الشركات التابعة لنا والشركات التابعة لنا
                            {'\n'} 0.3.2. للمقاولين ومقدمي الخدمات والأطراف الثالثة الأخرى التي نستخدمها لدعم أعمالنا
                            {'\n'} 0.3.3. لتحقيق الغرض الذي تقدمه من أجله
                            {'\n'}  0.3.4. لغرض تضمين شعار شركتك على موقعنا
                            {'\n'} 0.3.5. لأي غرض آخر نكشف عنه عند تقديم المعلومات
                            {'\n'}  0.3.6. بموافقتك في أي حالات أخرى
                            {'\n'}  0.3.7. إذا كنا نعتقد أن الإفصاح ضروري أو مناسب لحماية حقوق أو ممتلكات أو سلامة الشركة أو عملائنا أو غيرهم.
                            {'\n'}  9. أمن البيانات
                            أمان بياناتك مهم بالنسبة لنا ولكن تذكر أنه لا توجد وسيلة نقل عبر الإنترنت أو طريقة تخزين إلكتروني آمنة بنسبة 100٪. بينما نسعى جاهدين لاستخدام وسائل مقبولة تجاريًا لحماية بياناتك الشخصية ، لا يمكننا ضمان أمنها المطلق.
                            {'\n'} 10. حقوق حماية البيانات الخاصة بك بموجب اللائحة العامة لحماية البيانات (GDPR)
                            إذا كنت مقيمًا في الاتحاد الأوروبي (EU) والمنطقة الاقتصادية الأوروبية (EEA) ، فلديك بعض حقوق حماية البيانات التي يغطيها القانون العام لحماية البيانات (GDPR).
                            نهدف إلى اتخاذ خطوات معقولة للسماح لك بتصحيح أو تعديل أو حذف أو تقييد استخدام بياناتك الشخصية.
                            إذا كنت ترغب في إبلاغك بالبيانات الشخصية التي نحتفظ بها عنك وإذا كنت تريد إزالتها من أنظمتنا ، فيرجى مراسلتنا عبر البريد الإلكتروني على info@bnody.com.
                            في ظروف معينة ، تتمتع بحقوق حماية البيانات التالية:
                            {'\n'} 0.1. الحق في الوصول إلى المعلومات التي لدينا عنك أو تحديثها أو حذفها
                            {'\n'} 0.2 حق التصحيح ، لديك الحق في تصحيح معلوماتك إذا كانت هذه المعلومات غير دقيقة أو غير كاملة
                            {'\n'} 0.3 الحق في الاعتراض، لديك الحق في الاعتراض على معالجتنا لبياناتك الشخصية
                            {'\n'} 0.4 حق التقييد ،  لديك الحق في طلب تقييد معالجة معلوماتك الشخصية
                            {'\n'} 0.5 الحق في نقل البيانات ، لديك الحق في الحصول على نسخة من بياناتك الشخصية بتنسيق منظم وقابل للقراءة آليًا وشائع الاستخدام
                            {'\n'} 0.6 الحق في سحب الموافقة ، لديك أيضًا الحق في سحب موافقتك في أي وقت حيث نعتمد على موافقتك لمعالجة معلوماتك الشخصية
                            يرجى ملاحظة أننا قد نطلب منك التحقق من هويتك قبل الرد على هذه الطلبات ، ويرجى ملاحظة أننا قد لا نتمكن من تقديم الخدمة بدون بعض البيانات الضرورية.
                            لديك الحق في تقديم شكوى إلى هيئة حماية البيانات بشأن جمعنا لبياناتك الشخصية واستخدامها ، لمزيد من المعلومات يرجى الاتصال بهيئة حماية البيانات المحلية في المنطقة الاقتصادية الأوروبية (EEA).
                            {'\n'}  11. حقوق حماية البيانات الخاصة بك بموجب قانون حماية الخصوصية لولاية كاليفورنيا (CalOPPA)
                            CalOPPA هو أول قانون ولاية في الدولة يطالب المواقع التجارية والخدمات عبر الإنترنت بنشر سياسة الخصوصية ، يمتد نطاق القانون إلى ما هو أبعد من ولاية كاليفورنيا ليطلب من شخص أو شركة في الولايات المتحدة (ويمكن تصوره للعالم) تشغيل مواقع الويب التي تجمع معلومات التعريف الشخصية من مستهلكي كاليفورنيا لنشر سياسة خصوصية واضحة على موقع الويب الخاص بها توضح بالضبط المعلومات التي يتم جمعها وتلك الأفراد الذين يتم مشاركتها معهم ، والامتثال لهذه السياسة.
                            وفقًا لـ CalOPPA ، نوافق على ما يلي:
                            {'\n'} 0.1. يمكن للمستخدمين زيارة موقعنا بشكل مجهول
                            {'\n'} 0.2 يشتمل رابط سياسة الخصوصية الخاصة بنا على كلمة "الخصوصية" ، ويمكن العثور عليه بسهولة على الصفحة الرئيسية لموقعنا على الويب
                            {'\n'}  0.3 سيتم إخطار المستخدمين بأي تغييرات في سياسة الخصوصية على صفحة سياسة الخصوصية الخاصة بنا
                            {'\n'}  0.4 يمكن للمستخدمين تغيير معلوماتهم الشخصية عن طريق مراسلتنا عبر البريد الإلكتروني على info@bnody.com.
                            سياستنا بشأن إشارات "عدم التعقب":
                            نحن نحترم إشارات عدم التتبع ولا نتتبع ملفات تعريف الارتباط أو نزرعها أو نستخدم الإعلانات عندما تكون آلية متصفح عدم التعقب في مكانها الصحيح ،عدم التعقب هو تفضيل يمكنك تعيينه في متصفح الويب الخاص بك لإعلام مواقع الويب بأنك لا تريد أن يتم تعقبك.
                            يمكنك تمكين أو تعطيل "عدم التعقب" من خلال زيارة صفحة "التفضيلات" أو "الإعدادات" في متصفح الويب الخاص بك.
                            {'\n'}  12. حقوق حماية البيانات الخاصة بك بموجب قانون خصوصية المستهلك في كاليفورنيا (CCPA)
                            إذا كنت مقيمًا في كاليفورنيا ، فيحق لك معرفة البيانات التي نجمعها عنك ، واطلب حذف بياناتك وعدم بيعها (مشاركتها). لممارسة حقوق حماية البيانات الخاصة بك ، يمكنك تقديم طلبات معينة و مطالبتنا بما يلي:
                            {'\n'} 0.1. ما هي المعلومات الشخصية التي لدينا عنك. إذا قمت بتقديم هذا الطلب ، سنعود إليك:
                            {'\n'} 0.0.1. فئات المعلومات الشخصية التي جمعناها عنك.
                            {'\n'} 0.0.2. فئات المصادر التي تجمع منها معلوماتك الشخصية.
                            {'\n'} 0.0.3. الغرض التجاري أو التجاري لجمع أو بيع معلوماتك الشخصية.
                            {'\n'}  0.0.4. فئات الجهات الخارجية التي نشارك معها المعلومات الشخصية.
                            {'\n'}  0.0.5. الأجزاء المحددة من المعلومات الشخصية التي جمعناها عنك.
                            {'\n'} 0.0.6. قائمة بفئات المعلومات الشخصية التي قمنا ببيعها ، إلى جانب فئة أي شركة أخرى قمنا ببيعها لها. إذا لم نقم ببيع معلوماتك الشخصية ، فيس نبلغك بهذه الحقيقة.
                            {'\n'}  0.0.7. قائمة بفئات المعلومات الشخصية التي كشفنا عنها لغرض تجاري ، جنبًا إلى جنب مع فئة أي شركة أخرى شاركنا بها معها.
                            يرجى ملاحظة أنه يحق لك أن تطلب منا تزويدك بهذه المعلومات حتى مرتين في فترة اثني عشر شهرًا. عند تقديم هذا الطلب ، قد تقتصر المعلومات المقدمة على المعلومات الشخصية التي جمعناها عنك في الاثني عشر شهرًا الماضية.
                            {'\n'} 0.2 حذف معلوماتك الشخصية. إذا قمت بتقديم هذا الطلب ، سنقوم بحذف المعلومات الشخصية التي نحتفظ بها عنك اعتبارًا من تاريخ طلبك من سجلاتنا وتوجيه أي من مزودي الخدمة لفعل الشيء نفسه. في بعض الحالات ، يمكن أن يتم الحذف من خلال إلغاء تعريف المعلومات. إذا اخترت حذف معلوماتك الشخصية ، فقد لا تتمكن من استخدام وظائف معينة تتطلب تشغيل معلوماتك الشخصية.
                            {'\n'} 0.3 للتوقف عن بيع معلوماتك الشخصية. نحن لا نبيع أو نؤجر معلوماتك الشخصية لأي طرف ثالث لأي غرض من الأغراض. نحن لا نبيع معلوماتك الشخصية مقابل مادي. ومع ذلك ، في بعض الظروف ، يمكن اعتبار نقل المعلومات الشخصية إلى طرف ثالث ، أو داخل مجموعة شركاتنا ، دون مقابل نقدي ، بمثابة "بيع" بموجب قانون ولاية كاليفورنيا. أنت المالك الوحيد لبياناتك الشخصية ويمكنك طلب الكشف أو الحذف في أي وقت.
                            إذا قمت بتقديم طلب لوقف بيع معلوماتك الشخصية ، فسوف نتوقف عن إجراء عمليات النقل هذه.
                            يرجى ملاحظة أنه إذا طلبت منا حذف بياناتك أو التوقف عن بيعها ، فقد يؤثر ذلك على تجربتك معنا ، وقد لا تتمكن من المشاركة في بعض البرامج أو خدمات العضوية التي تتطلب استخدام معلوماتك الشخصية لتعمل. ولكن في أي ظرف من الظروف ، سوف نميز ضدك بسبب ممارستك لحقوقك.
                            لممارسة حقوق حماية بيانات كاليفورنيا الموضحة أعلاه ، يرجى إرسال طلبك (طلباتك) عبر البريد الإلكتروني: info@bnody.com.
                            حقوق حماية البيانات الخاصة بك ، الموضحة أعلاه ، مغطاة بقانون حماية خصوصية المستهلك في كاليفورنيا ، باختصار لقانون خصوصية المستهلك في كاليفورنيا. لمعرفة المزيد ، قم بزيارة الموقع الرسمي للمعلومات التشريعية لولاية كاليفورنيا. دخلت CCPA حيز التنفيذ في 01/01/2020.
                            {'\n'} 13. مقدمو الخدمة
                            يجوز لنا توظيف شركات وأفراد من أطراف ثالثة لتسهيل خدمتنا ("مزودي الخدمة") ، أو تقديم الخدمة نيابة عنا ، أو أداء الخدمات المتعلقة بالخدمة أو مساعدتنا في تحليل كيفية استخدام خدمتنا.
                            هذه الأطراف الثالثة لديها حق الوصول إلى بياناتك الشخصية فقط لأداء هذه المهام نيابة عنا وهي ملزمة بعدم الكشف عنها أو استخدامها لأي غرض آخر.
                            {'\n'}  14. التحليلات
                            قد نستخدم مزودي خدمة تابعين لجهات خارجية لمراقبة وتحليل استخدام خدمتنا.
                            {'\n'} 15. أدوات CI / CD
                            قد نستخدم مزودي خدمة من جهات خارجية لأتمتة عملية تطوير خدماتنا.
                            {'\n'} 16. تجديد النشاط التسويقي السلوكي
                            قد نستخدم خدمات تجديد النشاط التسويقي للإعلان لك على مواقع الطرف الثالث بعد زيارتك لخدمتنا. نستخدم نحن الموردين الخارجيين ملفات تعريف الارتباط للإبلاغ عن الإعلانات وتحسينها وعرضها بناءً على زياراتك السابقة لخدمتنا.
                            {'\n'} 17. المدفوعات
                            قد نقدم منتجات و / أو خدمات مدفوعة ضمن الخدمة. في هذه الحالة ، نستخدم خدمات الجهات الخارجية لمعالجة الدفع (مثل معالجات الدفع).
                            لن نقوم بتخزين أو جمع تفاصيل بطاقة الدفع الخاصة بك. يتم تقديم هذه المعلومات مباشرة إلى معالجة الدفع التابعين لجهات خارجية والذين يخضع استخدامك لمعلوماتك الشخصية لسياسة الخصوصية الخاصة بهم. تلتزم معالجات الدفع هذه بالمعايير التي حددتها PCI-DSS كما يديرها مجلس معايير أمان PCI ، وهو جهد مشترك لعلامات تجارية مثل Visa و Mastercard و American Express و Discover. تساعد متطلبات PCI-DSS على ضمان المعالجة الآمنة لمعلومات الدفع.
                            {'\n'}  18. روابط لمواقع أخرى
                            قد تحتوي خدمتنا على روابط لمواقع أخرى لا نقوم بتشغيلها. إذا قمت بالنقر فوق ارتباط جهة خارجية ، فسيتم توجيهك إلى موقع هذا الطرف الثالث. ننصحك بشدة بمراجعة سياسة الخصوصية لكل موقع تزوره.
                            ليس لدينا أي سيطرة ولا نتحمل أي مسؤولية عن المحتوى أو سياسات الخصوصية أو الممارسات الخاصة بأي مواقع أو خدمات خاصة بطرف ثالث.
                            على سبيل المثال ، المبينسياسة خاصةتم استخدامPolicyMaker.io، أداة مجانية تساعد في إنشاء مستندات قانونية عالية الجودة. صانع السياسة منشئ سياسة الخصوصية هي أداة سهلة الاستخدام لإنشاء ملف سياسة الخصوصية لمدونة أو موقع ويب أو متجر تجارة إلكترونية أو تطبيق جوال.
                            {'\n'} 19. خصوصية الأطفال
                            خدماتنا غير مخصصة للاستخدام من قبل الأطفال الذين تقل أعمارهم عن 18 عامًا ("الطفل" أو "الأطفال").
                            نحن لا نجمع عن عمد معلومات تعريف شخصية من الأطفال دون سن 18 عامًا. إذا علمت أن أحد الأطفال قد زودنا ببيانات شخصية ، فيرجى الاتصال بنا. إذا علمنا أننا جمعنا بيانات شخصية من الأطفال دون التحقق من موافقة الوالدين ، فإننا نتخذ خطوات لإزالة هذه المعلومات من خوادمنا.
                            {'\n'} 20. التغييرات في سياسة الخصوصية هذه
                            قد نقوم بتحديث سياسة الخصوصية الخاصة بنا من وقت لآخر. سنخطرك  بأي تغييرات عن طريق نشر سياسة الخصوصية الجديدة على هذه الصفحة.
                            سنخبرك عبر البريد الإلكتروني و / أو إشعارًا بارزًا على خدمتنا ، قبل أن يصبح التغيير ساريًا وتحديث "التاريخ الفعلي" في الجزء العلوي من سياسة الخصوصية هذه.
                            يُنصح بمراجعة سياسة الخصوصية هذه بشكل دوري لمعرفة أي تغييرات. تسري التغييرات التي تطرأ على سياسة الخصوصية هذه عند نشرها على هذه الصفحة.
                            {'\n'}  21. اتصل بنا
                            إذا كان لديك أي أسئلة حول سياسة الخصوصية هذه ، يرجى الاتصال بنا عبر البريد الإلكتروني: info@bnody.com.

                        </Text>

                    </ScrollView>
                    <View
                        style={{
                            flexDirection: 'row',
                            justifyContent: 'flex-end',
                            paddingVertical: sizeHelper.calHp(10),
                        }}>
                        <CustomButton
                            containerStyle={{
                                height: sizeHelper.calWp(50),
                                width: sizeHelper.calWp(200),
                                marginTop: sizeHelper.calHp(25),
                            }}
                            backgroundColor={AppColor.blue2}
                            //  isDisabled={isPromptAlert && !terminalCode}

                            title={I18nManager.isRTL ? "قبول" : "Accept"}
                            titleColor={AppColor.white}
                            onPressButton={() => {
                                onAcceptPrivacy()
                            }}
                        />
                        <CustomButton
                            containerStyle={{
                                height: sizeHelper.calWp(50),
                                width: sizeHelper.calWp(200),
                                marginTop: sizeHelper.calHp(25),
                                marginStart: sizeHelper.calHp(25),
                                backgroundColor: AppColor.red1,
                            }}
                            backgroundColor={AppColor.red1}
                            // isDisabled={isPromptAlert && !terminalCode}
                            title={I18nManager.isRTL ? "رفض" : "Reject"}
                            titleColor={AppColor.white}
                            onPressButton={() => onPressCancel()}
                        />
                    </View>
                </View>
            </View>
        </Modal>
    );
};

const mapStateToProps = state => {
    return {
        StringsList: state.user.SaveAllData.StringsList,
    };
};

const mapDispatchToProps = dispatch => ({
    dispatch,
});

export default connect(mapStateToProps, mapDispatchToProps)(PrivacyPolicy);
